cf_billing/InformationRegisters/энргРазмерыГосПошлины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРазмерыГосПошлины</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиЮрОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиЮрОтдела</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начальник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonModules/энргПретензионноИсковаяДеятельностьСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетГосПошлины

Функция ГосПошлина(Период,СуммаЗадолженности) Экспорт 
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("Период",				Период);
	Запрос.УстановитьПараметр("СуммаЗадолженности",	СуммаЗадолженности);
	Запрос.Текст 		="ВЫБРАТЬ
	|	энргРазмерыГосПошлиныСрезПоследних.Период,
	|	энргРазмерыГосПошлиныСрезПоследних.СуммаЗадолженность,
	|	энргРазмерыГосПошлиныСрезПоследних.Процент,
	|	энргРазмерыГосПошлиныСрезПоследних.ФиксированнаяСумма,
	|	энргРазмерыГосПошлиныСрезПоследних.СуммаДоПревышения,
	|	энргРазмерыГосПошлиныСрезПоследних.МаксимальнаяСумма,
	|	энргРазмерыГосПошлиныСрезПоследних.МинимальнаяСумма
	|ПОМЕСТИТЬ Набор
	|ИЗ
	|	РегистрСведений.энргРазмерыГосПошлины.СрезПоследних(&Период, ) КАК энргРазмерыГосПошлиныСрезПоследних
	|ГДЕ
	|	энргРазмерыГосПошлиныСрезПоследних.Актуальность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.СуммаЗадолженность,
	|	ВложенныйЗапрос.Процент,
	|	ВложенныйЗапрос.ФиксированнаяСумма,
	|	ВложенныйЗапрос.СуммаДоПревышения,
	|	ВложенныйЗапрос.МаксимальнаяСумма,
	|	ВложенныйЗапрос.СуммаГраница,
	|	ВложенныйЗапрос.МинимальнаяСумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборМинСумма.СуммаЗадолженность КАК СуммаЗадолженность,
	|		НаборМинСумма.Процент КАК Процент,
	|		НаборМинСумма.ФиксированнаяСумма КАК ФиксированнаяСумма,
	|		НаборМинСумма.СуммаДоПревышения КАК СуммаДоПревышения,
	|		НаборМинСумма.МаксимальнаяСумма КАК МаксимальнаяСумма,
	|		МИНИМУМ(ВЫБОР
	|				КОГДА НаборМаксСумма.СуммаЗадолженность ЕСТЬ NULL 
	|					ТОГДА 10000000000000000000000000000000
	|				ИНАЧЕ НаборМаксСумма.СуммаЗадолженность - 1
	|			КОНЕЦ) КАК СуммаГраница,
	|		НаборМинСумма.МинимальнаяСумма КАК МинимальнаяСумма
	|	ИЗ
	|		Набор КАК НаборМинСумма
	|			ЛЕВОЕ СОЕДИНЕНИЕ Набор КАК НаборМаксСумма
	|			ПО НаборМинСумма.СуммаЗадолженность < НаборМаксСумма.СуммаЗадолженность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НаборМинСумма.СуммаЗадолженность,
	|		НаборМинСумма.Процент,
	|		НаборМинСумма.ФиксированнаяСумма,
	|		НаборМинСумма.СуммаДоПревышения,
	|		НаборМинСумма.МаксимальнаяСумма,
	|		НаборМинСумма.МинимальнаяСумма) КАК ВложенныйЗапрос
	|ГДЕ
	|	&СуммаЗадолженности МЕЖДУ ВложенныйЗапрос.СуммаЗадолженность И ВложенныйЗапрос.СуммаГраница";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить процентные ставки расчета госпошлины");
	КонецЕсли;
	
	Выборка  = Результат.Выбрать();
	Выборка.Следующий();	
	
	Процент  		= Выборка.Процент;
	Если не ЗначениеЗаполнено(Выборка.СуммаДоПревышения) тогда
		СуммаГоспошлины = СуммаЗадолженности * Выборка.Процент /100;
	иначе
		СуммаГоспошлины = (СуммаЗадолженности-Выборка.СуммаДоПревышения) * Выборка.Процент /100
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.МинимальнаяСумма) тогда
		СуммаГоспошлины = Макс(Выборка.МинимальнаяСумма,СуммаГоспошлины);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.МаксимальнаяСумма) тогда
		СуммаГоспошлины = Мин(Выборка.МаксимальнаяСумма,СуммаГоспошлины);
	КонецЕсли;
	
	Возврат СуммаГоспошлины;
	
КонецФункции

#КонецОбласти

#Область Отправка_писем

// Рег задание без параметров
Процедура УведомитьПользователяЮрОтделаРегЗадание() Экспорт
	
	УведомитьПользователяЮрОтдела();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Уведомление с параметрами на случай если необходимы отборы
Процедура УведомитьПользователяЮрОтдела(Организация = Неопределено,Район = Неопределено, Пользователь = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргНастройкиЮрОтдела.Организация КАК Организация,
		|	энргНастройкиЮрОтдела.Район КАК Район,
		|	энргНастройкиЮрОтдела.Начальник КАК Начальник
		|ПОМЕСТИТЬ ВТ_Начальники
		|ИЗ
		|	РегистрСведений.энргНастройкиЮрОтдела КАК энргНастройкиЮрОтдела
		|ГДЕ
		|	1 = 1
		|	И энргНастройкиЮрОтдела.Организация = &Организация
		|	И энргНастройкиЮрОтдела.Район = &Район
		|	И энргНастройкиЮрОтдела.Начальник = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Почта КАК Почта,
		|	энргЗадачаПИДЗадачиПоИсполнителю.Абонент КАК Абонент,
		|	энргЗадачаПИДЗадачиПоИсполнителю.ЛицевойСчет КАК ЛицевойСчет,
		|	ВложенныйЗапрос.Начальник КАК Начальник
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """") КАК Почта,
		|		ВТ_Начальники.Начальник КАК Начальник,
		|		ВТ_Начальники.Организация КАК Организация,
		|		ВТ_Начальники.Район КАК Район
		|	ИЗ
		|		ВТ_Начальники КАК ВТ_Начальники
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|			ПО ВТ_Начальники.Начальник = ПользователиКонтактнаяИнформация.Ссылка
		|				И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMAILПользователя))
		|				И (ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.ЗадачиПоИсполнителю КАК энргЗадачаПИДЗадачиПоИсполнителю
		|		ПО ВложенныйЗапрос.Организация = энргЗадачаПИДЗадачиПоИсполнителю.Организация
		|			И ВложенныйЗапрос.Район = энргЗадачаПИДЗадачиПоИсполнителю.Район
		|			И ВложенныйЗапрос.Начальник = энргЗадачаПИДЗадачиПоИсполнителю.Исполнитель
		|			И (НЕ энргЗадачаПИДЗадачиПоИсполнителю.Выполнена)
		|			И (НЕ энргЗадачаПИДЗадачиПоИсполнителю.ПометкаУдаления)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Этап = &Этап)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.ДатаУчётаНачислений МЕЖДУ &НП И &КП)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Организация = &Организация)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Район = &Район)
		|			И (энргЗадачаПИДЗадачиПоИсполнителю.Исполнитель = &Пользователь)
		|ИТОГИ
		|	МАКСИМУМ(Почта)
		|ПО
		|	Начальник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Отправитель
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка = ЗНАЧЕНИЕ(Справочник.УчетныеЗАписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)";
	
	КП = НачалоДня(ТекущаяДата()) - 1;
	
	Запрос.УстановитьПараметр("Этап"	,Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_РешениеСуда);
	Запрос.УстановитьПараметр("НП"		,НачалоДня(КП));
	Запрос.УстановитьПараметр("КП"		,КП);
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Организация = &Организация","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргЗадачаПИДЗадачиПоИсполнителю.Организация = &Организация)","");
	Иначе 
		Запрос.УстановитьПараметр("Организация"	,Организация);
	КонецЕсли;
	Если Район = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Район = &Район","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргЗадачаПИДЗадачиПоИсполнителю.Район = &Район)","");
	Иначе 
		Запрос.УстановитьПараметр("Район"	,Район);
	КонецЕсли;
	Если Пользователь = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Начальник = &Пользователь","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргЗадачаПИДЗадачиПоИсполнителю.Исполнитель = &Пользователь)","");
	Иначе 
		Запрос.УстановитьПараметр("Пользователь"	,Пользователь);
	КонецЕсли;
	
	
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();	
	ВыборкаНачальник 	= РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОтправитель 	= РезультатЗапроса[2].Выбрать();
	ВыборкаОтправитель.следующий();
	Отправитель 		= ВыборкаОтправитель.Отправитель;
	Если не ЗначениеЗаполнено(Отправитель) Тогда
		ЗаписьЖурналаРегистрации("Уведомление пользователей юридического отдела",УровеньЖурналаРегистрации.Ошибка,,,"Не заполнена системная учетная запись.");
		Возврат;
	КонецЕсли;
	
	
	Пока ВыборкаНачальник.Следующий() Цикл
		Попытка			
			
			Если не ЗначениеЗаполнено(СокрЛП(ВыборкаНачальник.Почта)) Тогда
				ВызватьИсключение "Не указана почта у пользователя: " + ВыборкаНачальник.Начальник;
			КонецЕсли;
			
			Тело 		= "Переданы пакеты документов по следующим абонентам:" + Символы.ПС;
			
			Выборка 	= ВыборкаНачальник.Выбрать();
			Пока Выборка.Следующий() Цикл
				Тело = Тело + СокрЛП(Выборка.Абонент) + "(" + СокрЛП(Выборка.ЛицевойСчет) + ")" + Символы.ПС;		
			КонецЦикла;
			
			ПараметрыОтправки = Новый Структура("Кому, Тема, Тело", ВыборкаНачальник.Почта, "Переданные пакеты документов", Тело);
			
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Отправитель, ПараметрыОтправки);
			
			УровеньЖурнала 	 = УровеньЖурналаРегистрации.Информация;
			ТекстДляЖурнала  = "Успешно отправлено по начальнику: " + ВыборкаНачальник.Начальник;
		Исключение
			УровеньЖурнала 	 = УровеньЖурналаРегистрации.Ошибка;
			ТекстДляЖурнала  = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
		
		ЗаписьЖурналаРегистрации("Уведомление пользователей юридического отдела",УровеньЖурнала,,,ТекстДляЖурнала);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
